#### AdvancedOpaque Members

---

|  |
| --- |
| AdvancedOpaque Class   Properties   See Also |

The  AdvancedOpaque  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | OpaqueAlbedo | The property labeled "Color" from the "AdvancedOpaque" schema. |
| Public property Static member | OpaqueEmission | The property labeled "Emission" from the "AdvancedOpaque" schema. |
| Public property Static member | OpaqueF0 | The property labeled "Specular reflectance" from the "AdvancedOpaque" schema. |
| Public property Static member | OpaqueLuminance | The property labeled "Emissive Luminance" from the "AdvancedOpaque" schema. |
| Public property Static member | OpaqueLuminanceModifier | The property labeled "Luminance Scale" from the "AdvancedOpaque" schema. |
| Public property Static member | OpaqueMfp | The property labeled "Translucency Depth" from the "AdvancedOpaque" schema. |
| Public property Static member | OpaqueMfpModifier | The property labeled "Translucency Weight" from the "AdvancedOpaque" schema. |
| Public property Static member | OpaqueTranslucency | The property labeled "Translucency" from the "AdvancedOpaque" schema. |
| Public property Static member | SurfaceAlbedo | The property labeled "Color" from the "AdvancedOpaque" schema. |
| Public property Static member | SurfaceAnisotropy | The property labeled "Anisotropy" from the "AdvancedOpaque" schema. |
| Public property Static member | SurfaceCutout | The property labeled "Image" from the "AdvancedOpaque" schema. |
| Public property Static member | SurfaceNdfType | The property labeled "NDF" from the "AdvancedOpaque" schema. |
| Public property Static member | SurfaceNormal | The property labeled "Image" from the "AdvancedOpaque" schema. |
| Public property Static member | SurfaceRotation | The property labeled "Rotation" from the "AdvancedOpaque" schema. |
| Public property Static member | SurfaceRoughness | The property labeled "Roughness" from the "AdvancedOpaque" schema. |

# See Also

AdvancedOpaque Class

Autodesk.Revit.DB.Visual Namespace